{
  "HomePage": {
    "title-top": "Hello, I'm Maksim, a Frontend Developer",
    "location-timezone": "Riga (Latvia) UTC/GMT+2",
    "fantastic": "fantastic",
    "amazing": "amazing",
    "stunning": "stunning",
    "attractive": "attractive",
    "title-middle": "building amazing websites using",
    "title-bottom": "modern frameworks like:",
    "home_button": "Redirect to home page button",
    "about": "Go to the about page",
    "about-me": {
      "connect": "Connect",
      "tech_stack": "Stacks I am using",
      "favorite_songs": "Favorite songs",
      "favorite_books": "Favorite books"
    },
    "layout": {
      "about": "About",
      "blog": "Blog",
      "guestbook": "Guestbook",
      "home": "Home",
      "projects": "Projects",
      "toggle-menu": "Toggle menu",
      "contact": "Contact",
      "reviews": "Reviews",
      "telegram": "Telegram",
      "instagram": "Instagram",
      "github": "github",
      "linkedin": "Linkedin",
      "now-playing": {
        "loading": "Loading",
        "error": "Something went wrong",
        "not-listening": "Not listening any music at the moment",
        "currently_playing": "Currently listening to:"
      }
    }
  },
  "ProjectCard": {
    "ecommerce": "E-commerce",
    "ecommerce_description": "Secure online shopping platform with integrated payments and inventory management.",
    "i_gambling_description": "Online casino platform development with secure payment systems, game integration, and regulatory compliance.",
    "i_gambling": "iGambling",
    "backend_related": "Backend related",
    "backend_related_description": "Telegram notification systems and crypto arbitrage solutions built with NestJS architecture.",
    "read_more": "Read more"
  },
  "About": {
    "hero_title": "About me",
    "hero_brief_desc": "Hey there! I'm a 22-year-old frontend developer with 3 years of experience in web development. I've also dipped my toes into backend work. I enjoy building clean, functional interfaces that look great and work even better. Always staying up-to-date with the latest UI/UX trends to create better user experiences. In my free time, I'm really into crypto :)",
    "me_in_poland": "this is me in Poland btw :)",
    "life_path": "My life path",
    "life_path_desc_1": "I was born in Jelgava, Latvia, and spent my childhood full of energy and curiosity. I tried many sports including judo, football, volleyball, and track and field. But everything changed in the second grade when I discovered swimming. From that moment, I dedicated the next 12 years to the sport. I became a Master of Sports, a national junior champion, and represented Latvia in international competitions. Eventually, I achieved my goals and decided to step away from professional sports.  ",
    "life_path_desc_2": "Alongside sports, I was always fascinated by gaming and technology. I played cooperative and multiplayer games with friends, with CS:GO being my favorite. That interest led me to my first experience with programming. I used to host Minecraft servers, install mods, and manage everything myself, without even realizing I was learning valuable skills.  ",
    "life_path_desc_3": "During the COVID lockdown, I could no longer train in the pool. That was a difficult time, and I decided to focus on something new. I took a free Python course on Stepik, but couldn’t find freelance work in that field. So I explored frontend development. I loved seeing live progress and improving user experiences. After a few months of learning through tutorials, a friend offered me a freelance project. I worked on a single-page application written in plain JavaScript, and that experience helped me grow as a frontend developer.  ",
    "life_path_desc_4": "Later, I joined SIA Softrocket as a frontend developer, working on large-scale projects in the iGaming industry. Each project generated over a million euros in monthly revenue. After some time, I sought a better work environment and transitioned to the e-commerce field. Today, I work as a lead frontend developer at BuySellVouchers.com, continuing to grow and build impactful products."
  },
  "Projects": {
    "hero_title": "Projects I have been working on",
    "hero_subtext": "Here is the list of projects I have been working on, showcasing my skills and expertise in various spheres and technologies. Each project reflects my dedication to quality and innovation."
  },
  "Ecommerce": {
    "ecommerce_projects_title": "E-commerce Excellence",
    "key_achivements": "Key Achievements",
    "tehnical_expertise": "Technical Expertise",
    "core_compents": "Core Competencies",
    "proven_impact": "Proven E-commerce Impact",
    "proven_impact_desc": "From building Shopify solutions that facilitate major municipal contracts to architecting modern Next.js applications that enhance performance and user experience, I deliver e-commerce solutions that drive real business results. My expertise spans the full development lifecycle, from strategic planning and team leadership to technical implementation and optimization.",
    "palami_status": "Live & Serving Major Clients",
    "palami_period": "2023 - 2024",
    "palami_desc": "Developed a comprehensive Shopify e-commerce platform for a leading LED display and bus station manufacturer, resulting in major municipal contracts across Riga.",
    "buysellvouchers_role": "Lead Frontend Developer",
    "buysellvouchers_company": "Online Marketplace",
    "buysellvouchers_period": "2024 - Present",
    "buysellvouchers_status": "Pre-production & QA Testing",
    "buysellvouchers_desc": "Leading frontend part migration from legacy Yii 1 framework to cutting-edge Next.js 15, while spearheading strategic technical decisions",
    "palami_role": "Shopify Developer",
    "palami_company": "LED Display Solutions",
    "achievement_palami_1": "LED screens and bus stations now deployed city-wide across Riga",
    "achievement_palami_2": "Implemented custom Liquid integrations for product configurations and features accross website",
    "achievement_bsv_1": "Architecting migration strategy from Yii 1 to Next.js 15",
    "achievement_bsv_3": "Significantly improved application performance and load times",
    "achievement_bsv_4": "Enhanced SEO capabilities with server-side rendering implementation",
    "achievement_bsv_5": "Redesigned UI/UX for improved user engagement and conversion rates",
    "skill_ecommerce_platforms": "E-commerce Platforms",
    "skill_frontend_technologies": "Frontend Technologies",
    "skill_performance_seo": "Performance & SEO",
    "skill_development_practices": "Development Practices",
    "skill_integration_apis": "Integration & APIs",
    "skill_tools_workflow": "Tools & Workflow"
  }
}
